ilogicsBoss/Board/CustomBoard/Hardware/ILOGICS/avr/variants/MPINO_2560/pins_arduino.h
// ─────────────────────────────────────────────────────────────────────────
//   Arduino 디지털 핀 → PWM 타이머 채널
//   analogWrite() 호출 시 사용되는 타이머/채널 정보
//
//   사용설명서 표기와의 대응 :
//     ─ 8A8R / 16A8R / 16A8R8T 공통 PWM ─
//     D5  = PWM0 (TIMER3A, OC3A)        D2  = PWM1 (TIMER3B, OC3B)
//     D3  = PWM2 (TIMER3C, OC3C)        D6  = PWM3 (TIMER4A, OC4A)
//     D7  = PWM4 (TIMER4B, OC4B)        D8  = PWM5 (TIMER4C, OC4C)
//
//     ─ 16A8R8T 펄스출력 / 아날로그 출력 ─
//     P(11) = D11 (TIMER1A, OC1A)       P(12) = D12 (TIMER1B, OC1B)
//     AO(6) = D6  (TIMER4A, OC4A)       AO(7) = D7  (TIMER4B, OC4B)
//       ※ AO(6)/AO(7) 와 TCNT4(고속카운터) 는 모두 TIMER4 자원을 사용하므로
//          동시에 사용할 수 없습니다 (사용설명서 4페이지 참조).
//
//     ─ 고속카운터 (analogWrite 미사용, 타이머만 점유) ─
//     TCNT1 (TIMER1)  : 8A8R  HCNT0
//     TCNT4 (TIMER4)  : 16A8R8T 고속카운터 1
//     TCNT5 (TIMER5)  : 8A8R HCNT1 / 16A8R8T 고속카운터 2
// ─────────────────────────────────────────────────────────────────────────
const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  NOT_ON_TIMER, // D0   USART0 RXD
  NOT_ON_TIMER, // D1   USART0 TXD
  TIMER3B,      // D2   PE4  PWM1 / INT4
  TIMER3C,      // D3   PE5  PWM2 / INT5
  TIMER0B,      // D4   PG5  (사용 시 millis()/delay() 영향 없음 - OC0B만 영향)
  TIMER3A,      // D5   PE3  PWM0
  TIMER4A,      // D6   PH3  PWM3 / AO(6) [16A8R8T]
  TIMER4B,      // D7   PH4  PWM4 / AO(7) [16A8R8T]
  TIMER4C,      // D8   PH5  PWM5
  TIMER2B,      // D9   PH6
  TIMER2A,      // D10  PB4
  TIMER1A,      // D11  PB5  P(11) 펄스출력 [16A8R8T]
  TIMER1B,      // D12  PB6  P(12) 펄스출력 [16A8R8T]
  TIMER0A,      // D13  PB7  STATUS LED (TIMER0A 는 millis() 용 - PWM 권장 안함)
  NOT_ON_TIMER, // D14  USART3 TXD
  NOT_ON_TIMER, // D15  USART3 RXD
  NOT_ON_TIMER, // D16  USART2 TXD
  NOT_ON_TIMER, // D17  USART2 RXD
  NOT_ON_TIMER, // D18  USART1 TXD
  NOT_ON_TIMER, // D19  USART1 RXD
  NOT_ON_TIMER, // D20  I2C SDA
  NOT_ON_TIMER, // D21  I2C SCL
  NOT_ON_TIMER, // D22  I(22)
  NOT_ON_TIMER, // D23  I(23)
  NOT_ON_TIMER, // D24  I(24)
  NOT_ON_TIMER, // D25  I(25)
  NOT_ON_TIMER, // D26  I(26)
  NOT_ON_TIMER, // D27  I(27)
  NOT_ON_TIMER, // D28  I(28)
  NOT_ON_TIMER, // D29  I(29)
  NOT_ON_TIMER, // D30  I(30)
  NOT_ON_TIMER, // D31  I(31)
  NOT_ON_TIMER, // D32  I(32)
  NOT_ON_TIMER, // D33  I(33)
  NOT_ON_TIMER, // D34  I(34)
  NOT_ON_TIMER, // D35  I(35)
  NOT_ON_TIMER, // D36  I(36)
  NOT_ON_TIMER, // D37  I(37)
  NOT_ON_TIMER, // D38
  NOT_ON_TIMER, // D39  O(39) / R(39)
  NOT_ON_TIMER, // D40  O(40) / R(40)
  NOT_ON_TIMER, // D41  O(41) / R(41)
  NOT_ON_TIMER, // D42  O(42) / R(42)
  NOT_ON_TIMER, // D43  O(43) / R(43)
  TIMER5C,      // D44  PL5  (PWM 가능, MPINO 에서는 O(44)/R(44) 디지털 출력)
  TIMER5B,      // D45  PL4  (PWM 가능, MPINO 에서는 O(45)/R(45) 디지털 출력)
  TIMER5A,      // D46  PL3  (PWM 가능, MPINO 에서는 O(46)/R(46) 디지털 출력)
  NOT_ON_TIMER, // D47  TCNT5 고속카운터 입력 (T5)
  NOT_ON_TIMER, // D48
  NOT_ON_TIMER, // D49
  NOT_ON_TIMER, // D50  SPI MISO
  NOT_ON_TIMER, // D51  SPI MOSI
  NOT_ON_TIMER, // D52  SPI SCK
  NOT_ON_TIMER, // D53  SPI SS
  NOT_ON_TIMER, // D54  A0
  NOT_ON_TIMER, // D55  A1
  NOT_ON_TIMER, // D56  A2
  NOT_ON_TIMER, // D57  A3
  NOT_ON_TIMER, // D58  A4  T(4)
  NOT_ON_TIMER, // D59  A5  T(5)
  NOT_ON_TIMER, // D60  A6
  NOT_ON_TIMER, // D61  A7
  NOT_ON_TIMER, // D62  R(62)
  NOT_ON_TIMER, // D63  R(63)
  NOT_ON_TIMER, // D64  R(64)
  NOT_ON_TIMER, // D65  R(65)
  NOT_ON_TIMER, // D66  R(66)
  NOT_ON_TIMER, // D67  R(67)
  NOT_ON_TIMER, // D68  R(68)
  NOT_ON_TIMER, // D69  R(69)
  NOT_ON_TIMER, // D70
  NOT_ON_TIMER, // D71
  NOT_ON_TIMER, // D72
  NOT_ON_TIMER, // D73
  NOT_ON_TIMER, // D74  TCNT4 고속카운터 입력 (T4) [16A8R8T]
  NOT_ON_TIMER, // D75
  NOT_ON_TIMER, // D76
  NOT_ON_TIMER, // D77
  NOT_ON_TIMER, // D78
  NOT_ON_TIMER, // D79  TCNT1 고속카운터 입력 (T1) [8A8R]
  NOT_ON_TIMER, // D80
  NOT_ON_TIMER, // D81
  NOT_ON_TIMER, // D82
  NOT_ON_TIMER, // D83
  NOT_ON_TIMER, // D84
  NOT_ON_TIMER, // D85
};

#endif

// ─────────────────────────────────────────────────────────────────────────
//   시리얼 포트 매핑
//   MPINO 의 단자 라벨과 USART 의 대응 관계
//
//      Serial    = USART0  (USB 다운로드 포트)
//      Serial1   = USART1  (RS232 단자)
//      Serial2   = USART2  (RS485 단자)
//      Serial3   = USART3  (UART 단자)
//
//   SERIAL_PORT_MONITOR        : Arduino 시리얼 모니터에 표시되는 기본 포트
//   SERIAL_PORT_HARDWARE       : 다운로드/모니터링용 1차 하드웨어 시리얼
//   SERIAL_PORT_HARDWARE_OPEN  : 외부 통신 단자 (RS232) 1차
//   SERIAL_PORT_HARDWARE_OPEN1 : 외부 통신 단자 (RS485) 2차
//   SERIAL_PORT_HARDWARE_OPEN2 : 외부 통신 단자 (UART)  3차
// ─────────────────────────────────────────────────────────────────────────
#define SERIAL_PORT_MONITOR         Serial
#define SERIAL_PORT_HARDWARE        Serial
#define SERIAL_PORT_HARDWARE1       Serial1
#define SERIAL_PORT_HARDWARE2       Serial2
#define SERIAL_PORT_HARDWARE3       Serial3
#define SERIAL_PORT_HARDWARE_OPEN   Serial1
#define SERIAL_PORT_HARDWARE_OPEN1  Serial2
#define SERIAL_PORT_HARDWARE_OPEN2  Serial3

#endif
